---
kind: method
id: M:Autodesk.Revit.DB.PrimarySizeCriterion.All
source: html/8c4f7e6d-a5bf-570e-f3b3-5962c799a9de.htm
---
# Autodesk.Revit.DB.PrimarySizeCriterion.All Method

Creates a criterion with a range of all sizes.

## Syntax (C#)
```csharp
public static PrimarySizeCriterion All()
```

## Returns
The new criterion.

## Exceptions
- **Autodesk.Revit.Exceptions.DisabledDisciplineException** - None of the following disciplines is enabled: Mechanical Electrical Piping.